# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
#
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет
number = int(input("Введите число, обозначающее день недели: "))
if number == 1:
    print("Это понедельник")
if number == 2:
    print("Это вторник")
if number == 3:
    print("Это среда")
if number == 4:
    print("Это четверг")
if number == 5:
    print("Это пятница")
if number == 6:
    print("Это суббота")
if number == 7:
    print("Это воскресенье")
if number < 1:
    print("Вы ввели не верное число. Введите от 1 до 7. ")
# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
#
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет
number = int(input("Введите число, обозначающее день недели: "))
if number == 1:
    print("Это понедельник")
if number == 2:
    print("Это вторник")
if number == 3:
    print("Это среда")
if number == 4:
    print("Это четверг")
if number == 5:
    print("Это пятница")
if number == 6:
    print("Это суббота")
if number == 7:
    print("Это воскресенье")
if number < 1 :
    print("Вы ввели не верное число. Введите от 1 до 7. ") 
