# Задайте список из n чисел последовательности (1 + 1/n) ** n и выведите на экран их сумму.
# Пример:
# -Для n=4 {1: 2, 2: 2.25, 3: 2.37, 4: 2.44}
# Сумма 9.06
n = int(input("Введите число: "))
sum=0
print("Для N = ",n,': {',end=' ')
for i in range(1,n):
    k=(1+1/i)**i
    print (i, round(k,2), sep=': ', end=', ')
    sum=sum+k
print(n,round((1+1/n)**(n),2),sep=': ', end='}')
print(" Сумма = ",round(sum+(1+1/n)**(n),2))