# Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой.
a=input("Введите исходную строку A: ")
b=input("Введите искомую строку B: ")
print(a.count(b))
